Masmiseim36/nxpSDK/boards/frdmkv11z/demo_apps/mc_bldc/pin_mux.h
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*!
 * @brief FTM0 channel 0 output PWM/OCMP mode source select: FTM0CH0 pin is the output of FTM0 channel 0 PWM/OCMP */
#define SOPT8_FTM0OCH0SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 1 output PWM/OCMP mode source select: FTM0CH1 pin is the output of FTM0 channel 1 PWM/OCMP */
#define SOPT8_FTM0OCH1SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 2 output PWM/OCMP mode source select: FTM0CH2 pin is the output of FTM0 channel 2 PWM/OCMP */
#define SOPT8_FTM0OCH2SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 3 output PWM/OCMP mode source select: FTM0CH3 pin is the output of FTM0 channel 3 PWM/OCMP */
#define SOPT8_FTM0OCH3SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 4 output PWM/OCMP mode source select: FTM0CH4 pin is the output of FTM0 channel 4 PWM/OCMP */
#define SOPT8_FTM0OCH4SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 5 output PWM/OCMP mode source select: FTM0CH5 pin is the output of FTM0 channel 5 PWM/OCMP */
#define SOPT8_FTM0OCH5SRC_NO_MODULATION 0x00u

/*! @name PORTC1 (number 44), FTM0_CH0
  @{ */
#define PINTOOL_PWM_FTM0_CH0_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_PWM_FTM0_CH0_PIN 1U     /*!<@brief PORTC pin index: 1 */
                                        /* @} */

/*! @name PORTC2 (number 45), FTM0_CH1
  @{ */
#define PINTOOL_PWM_FTM0_CH1_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_PWM_FTM0_CH1_PIN 2U     /*!<@brief PORTC pin index: 2 */
                                        /* @} */

/*! @name PORTC3 (number 46), FTM0_CH2
  @{ */
#define PINTOOL_PWM_FTM0_CH2_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_PWM_FTM0_CH2_PIN 3U     /*!<@brief PORTC pin index: 3 */
                                        /* @} */

/*! @name PORTC4 (number 49), FTM0_CH3
  @{ */
#define PINTOOL_PWM_FTM0_CH3_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_PWM_FTM0_CH3_PIN 4U     /*!<@brief PORTC pin index: 4 */
                                        /* @} */

/*! @name PORTD4 (number 61), FTM0_CH4
  @{ */
#define PINTOOL_PWM_FTM0_CH4_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_PWM_FTM0_CH4_PIN 4U     /*!<@brief PORTD pin index: 4 */
                                        /* @} */

/*! @name PORTD5 (number 62), FTM0_CH5
  @{ */
#define PINTOOL_PWM_FTM0_CH5_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_PWM_FTM0_CH5_PIN 5U     /*!<@brief PORTD pin index: 5 */
                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_PWM(void);

/*! @name PORTB0 (number 35), SW2
  @{ */
#define PINTOOL_MISC_SW2_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define PINTOOL_MISC_SW2_PORT PORTB /*!<@brief PORT device name: PORTB */
#define PINTOOL_MISC_SW2_PIN 0U     /*!<@brief PORTB pin index: 0 */
                                    /* @} */

/*! @name PORTA4 (number 26), SW3
  @{ */
#define PINTOOL_MISC_SW3_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define PINTOOL_MISC_SW3_PORT PORTA /*!<@brief PORT device name: PORTA */
#define PINTOOL_MISC_SW3_PIN 4U     /*!<@brief PORTA pin index: 4 */
                                    /* @} */

/*! @name PORTD6 (number 63), RGB_LED
  @{ */
#define PINTOOL_MISC_RGB_LED1_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define PINTOOL_MISC_RGB_LED1_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_MISC_RGB_LED1_PIN 6U     /*!<@brief PORTD pin index: 6 */
                                         /* @} */

/*! @name PORTE29 (number 17), RGB_LED4
  @{ */
#define PINTOOL_MISC_RGB_LED4_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define PINTOOL_MISC_RGB_LED4_PORT PORTE /*!<@brief PORT device name: PORTE */
#define PINTOOL_MISC_RGB_LED4_PIN 29U    /*!<@brief PORTE pin index: 29 */
                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_Misc(void);

/*! @name PORTE30 (number 18), ADC1_SE4
  @{ */
#define PINTOOL_ADC_ADC1_SE4_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define PINTOOL_ADC_ADC1_SE4_PORT PORTE /*!<@brief PORT device name: PORTE */
#define PINTOOL_ADC_ADC1_SE4_PIN 30U    /*!<@brief PORTE pin index: 30 */
                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_ADC(void);

#define SOPT5_UART0RXSRC_UART_RX 0x00u /*!<@brief UART 0 Receive Data Source Select: UART0_RX pin */
#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART 0 Transmit Data Source Select: UART0_TX pin */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_UART(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
